OpenFOAM/backstep/0.orig/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 1;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    outlet
    {
        type            zeroGradient;
    }

    inlet
    {
        type            turbulentMixingLengthFrequencyInlet;
        mixingLength    0.005;
        k               k;
        value           uniform 1;
    }

    walls
    {
        type            omegaWallFunction;
        value           uniform 0;
    }
}


// ************************************************************************* //
